InformationRegisters/Информация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>Информация</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВстроеноВРабочуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбращениеВТП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуальныйДляИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияВ1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВ1С</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВстроеноВРабочуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбращениеВТП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Информация/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовоеПредставление = ОткрытьФормуМодально("РегистрСведений.ИзмененияВ1С.Форма.ФормаНастройки", Новый Структура("ПредставлениеВыбранныхОбъектов", Запись.ОбъектМетаданных));
	
	Если Не НовоеПредставление = "" Тогда
		Запись.ОбъектМетаданных = НовоеПредставление;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсистемаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.Подсистема = Строка(ВыбратьИзСписка(СписокПодсистем, Элемент));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТекПодсистема Из Метаданные.Подсистемы Цикл
		СписокПодсистем.Добавить(ТекПодсистема.Синоним);	
	КонецЦикла;
	
	Если НЕ ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ИзмененияВ1С) Тогда
		Если Не Запись.ЕстьФорматируемыйДокумент Тогда
			Элементы.Группа5.Доступность = Ложь;		
		КонецЕсли;
		Элементы.Группа6.Доступность = Ложь;
		Элементы.Содержание.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период) И ЗначениеЗаполнено(Запись.Период) ТОгда
		Запись.Период = Запись.Период + 1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияПоОбъекту(Команда)
	
	ИзменитьФормуНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФормуНаСервере()
	
	МассивДобавляемыхРеквизитов = Новый Массив; 
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИнформацияПоОбъекту", Новый ОписаниеТипов("Строка"), "", "ИнформацияПоОбъекту"));    
		
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
	
	ОбщаяГруппаФормы = Элементы.Добавить("ОбщаяГруппаФормы", Тип("ГруппаФормы"), ЭтаФорма);
	ОбщаяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОбщаяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ОбщаяГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ОбщаяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	ВсеТекущиеЭлементыФормы = Элементы.Добавить("ВсеТекущиеЭлементыФормы", Тип("ГруппаФормы"), ОбщаяГруппаФормы);
	ВсеТекущиеЭлементыФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВсеТекущиеЭлементыФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ВсеТекущиеЭлементыФормы.ОтображатьЗаголовок = Ложь;
		
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если Не ЭлементФормы.Родитель = ЭтаФорма И Не ЭлементФормы.Родитель = ВсеТекущиеЭлементыФормы Тогда
			ПроверитьРодителяЭлемента(ЭлементФормы.Родитель);
			Продолжить;
		ИначеЕсли ЭлементФормы.Родитель = ЭтаФорма Тогда
			Элементы.Переместить(ЭлементФормы, ВсеТекущиеЭлементыФормы);	
		КонецЕсли;
	КонецЦикла;	
	
	ГруппаИнформацияПоОбъекту = Элементы.Добавить("ГруппаИнформацияПоОбъекту", Тип("ГруппаФормы"), ОбщаяГруппаФормы);
	ГруппаИнформацияПоОбъекту.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИнформацияПоОбъекту.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	
	ПолеФормы = Элементы.Добавить("ПолеИнформацияПоОбъекту", Тип("ПолеФормы"), ГруппаИнформацияПоОбъекту);
	ПолеФормы.ПутьКДанным = "ИнформацияПоОбъекту";
	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьРодителяЭлемента(ЭлементФормы)
	
	Если Не ЭлементФормы.Родитель = ЭтаФорма И Не ЭлементФормы.Родитель = Элементы.ВсеТекущиеЭлементыФормы Тогда
		ПроверитьРодителяЭлемента(ЭлементФормы.Родитель);
	ИначеЕсли ЭлементФормы.Родитель = ЭтаФорма Тогда
		Элементы.Переместить(ЭлементФормы, Элементы.ВсеТекущиеЭлементыФормы);	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Содержание = ТекущийОбъект.СодержаниеФорматируемыйДокумент.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 	ТекущийОбъект.СодержаниеФорматируемыйДокумент = Новый ХранилищеЗначения(Содержание, Новый СжатиеДанных(9));
	Если Содержание.Элементы.Количество() Тогда
		Если Содержание.Элементы.Количество() = 1 И ТипЗнч(Содержание.Элементы[0]) = Тип("ПараграфФорматированногоДокумента") И Содержание.Элементы[0].Элементы.Количество() = 0 Тогда
			ТекущийОбъект.ЕстьФорматируемыйДокумент = Ложь;
		Иначе	
			ТекущийОбъект.ЕстьФорматируемыйДокумент = Истина;
		КонецЕсли;		
	Иначе
		ТекущийОбъект.ЕстьФорматируемыйДокумент = Ложь;
	КонецЕсли;
	//ТекстHTML = "";
	//Вложения = Новый Структура;
	//Содержание.ПолучитьHTML(ТекстHTML, Вложения);
	
	//ТекущийОбъект.ТекстСодержания = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	
КонецПроцедуры
